# QUESTION 2

## Import dataset and data cleaning

In [315]:
import pandas as pd
from datetime import datetime

In [316]:
df=pd.read_csv(r"C:\Users\gianl\Documents\Università_4°anno(2022-2023\ADM\HOMEWORK\HOMEWORK 4\bank_transactions.csv", sep=",")

In [317]:
df['TransactionTime'] = df['TransactionTime'].apply(lambda x: datetime.strptime(str(x).zfill(6), '%H%M%S'))
df['CustomerDOB'] = pd.to_datetime(df['CustomerDOB'], format = '%d/%m/%y', errors = 'coerce')
df['TransactionDate'] = pd.to_datetime(df['TransactionDate'], format = '%d/%m/%y', errors = 'coerce')

In [191]:
a = df.groupby('CustomerID')

In [353]:
#for i in a:
#    print(i)

**There are some values missing but very few compering to the rest of the dataset, so we can drop it**

In [318]:
df = df.dropna()

**As we can see, there are a lot of birthdates on January 1st, which seems a little strange. There's also a lot of customers birth on 1/1/1800. This is probably some default the bank has where this information is unknown, althought that is a little strange. I'll remove them.**

In [180]:
df['CustomerDOB'].value_counts()

1989-01-01    809
1990-01-01    784
1991-08-06    698
1991-01-01    665
1992-01-01    631
             ...
2005-02-23      1
2042-11-28      1
2049-09-23      1
2040-03-14      1
2044-10-24      1
Name: CustomerDOB, Length: 17232, dtype: int64

In [319]:
df = df.loc[~(df['CustomerDOB'] == '1/1/1800')]

**There are people born after 2021, so just subtract 100 from the year of birth of these people**

In [320]:
df.loc[df['CustomerDOB'].dt.year >= 2021, ['CustomerDOB']] -= pd.DateOffset(years = 100)

# 2.1

In [302]:
#Let's create a new dataframe called new_df
new_df = pd.DataFrame()

**Number of transactions**

In [303]:
num_transaction = df.groupby(['CustomerID'])['TransactionID'].count()
new_df['NumTransaction'] = num_transaction

**Number of transactions > 100????**

In [219]:
train.groupby(['CustomerID'])[train['TransactionAmount (INR)'] > 100]

NameError: name 'train' is not defined

In [ ]:
df[df['TransactionAmount (INR)']  > 100]

**Average amount of transaction**

In [304]:
avg_amount_transaction = df.groupby(['CustomerID'])['TransactionAmount (INR)'].agg('mean')
new_df['AvgAmountTransaction'] = avg_amount_transaction

**Average balance**

In [305]:
#This command is to visualize a float number and not an exponential number
pd.options.display.float_format = '{:.2f}'.format  #This command is to visualize a float number and not an exponential number
avg_balance = df.groupby(['CustomerID'])['CustAccountBalance'].agg('mean')
new_df['AvgBalance'] = avg_balance

**Average difference between the balance and the transaction amount for each customer**

In [306]:
df['provvisoria'] = df['CustAccountBalance'] - df['TransactionAmount (INR)']
AvgDiffBalTrans = df.groupby(['CustomerID'])['provvisoria'].agg('mean')
new_df['AvgDiffBalTrans'] = AvgDiffBalTrans
del df['provvisoria']

**Gender of customers???**

In [307]:
Gender = df.groupby(['CustomerID'])['CustGender'].first()
new_df['Gender'] = Gender

In [204]:
new_df.groupby('Gender').count()

        NumTransaction  AvgAmountTransaction     AvgBalance  AvgDiffBalTrans
Gender
F               273256          367447135.92 23877167001.38   23509719865.46
M               712066          852260783.19 64943365789.12   64091105005.93

**Most frequent location of the customer???**

In [ ]:
Most frequent location of the customer

In [54]:
avg_balance = df.groupby(['CustomerID','CustLocation'])['TransactionID'].count()

In [55]:
avg_balance

CustomerID  CustLocation
C1010011    NEW DELHI       1
            NOIDA           1
C1010012    MUMBAI          1
C1010014    MUMBAI          2
C1010018    CHAMPARAN       1
                           ..
C9099836    BHIWANDI        1
C9099877    BANGALORE       1
C9099919    GUNTUR          1
C9099941    CHENNAI         1
C9099956    MUSSOORIE       1
Name: TransactionID, Length: 1040343, dtype: int64

In [190]:
df

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,1994-01-10,F,JAMSHEDPUR,17819.05,2016-08-02,1900-01-01 14:32:07,25.00
1,T2,C2142763,1957-04-04,M,JHAJJAR,2270.69,2016-08-02,1900-01-01 14:18:58,27999.00
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-08-02,1900-01-01 14:27:12,459.00
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,2016-08-02,1900-01-01 14:27:14,2060.00
4,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,2016-08-02,1900-01-01 18:11:56,1762.50
...,...,...,...,...,...,...,...,...,...
1048562,T1048563,C8020229,1990-04-08,M,NEW DELHI,7635.19,2016-09-18,1900-01-01 18:48:24,799.00
1048563,T1048564,C6459278,1992-02-20,M,NASHIK,27311.42,2016-09-18,1900-01-01 18:37:34,460.00
1048564,T1048565,C6412354,1989-05-18,M,HYDERABAD,221757.06,2016-09-18,1900-01-01 18:33:13,770.00
1048565,T1048566,C6420483,1978-08-30,M,VISAKHAPATNAM,10117.87,2016-09-18,1900-01-01 18:47:06,1000.00
1048566,T1048567,C8337524,1984-03-05,M,PUNE,75734.42,2016-09-18,1900-01-01 18:12:22,1166.00

## Create 20 additional features

The addictional futures that we will cosider are:

1. Highest transiction amount
2. Lowest transiction amount
3. Highest balance a customer has ever had
4. Lowest balance a customer has ever had
5. Number of transaction carried out just during the summer (June, July, August and September)
6. Number of transaction carried out just during the winter (November, Dicember, January and February)
7. Number of transaction carried out not in the rest of the months (March, April, May and October)
8. Age of customers on transition days
9. Number of transactions > 1000
10. Number of transactions > 5000
11. Number of transactions > 10000
12. Number of times a transition has been made in the most frequent location of the customer
13. Number of transitions made in the night (22-06)
14. Number of transitions made in the morning (06-14)
15. Number of transitions made in the evening (14-22)
16.
17.
18.
19.
20.

#### Once the additional features considered have been defined, we create them and add them to the 'new_df' dataset.

**1** (Highest transiction amount)

In [308]:
max_amount_transaction = df.groupby(['CustomerID'])['TransactionAmount (INR)'].agg('max')
new_df['MaxAmountTransaction'] = max_amount_transaction

**2** (Lowest transiction amount)

In [309]:
min_amount_transaction = df.groupby(['CustomerID'])['TransactionAmount (INR)'].agg('min')
new_df['MinAmountTransaction'] = min_amount_transaction

**3** (Highest balance a customer has ever had)

In [310]:
max_balace = df.groupby(['CustomerID'])['CustAccountBalance'].agg('max')
new_df['MaxBalance'] = max_balace

**4** (Lowest balance a customer has ever had)

In [311]:
min_balace = df.groupby(['CustomerID'])['CustAccountBalance'].agg('min')
new_df['MinBalance'] = min_balace

**5** (Number of transaction carried out just during the summer (June, July, August and September)

In [28]:
df['TransactionDate'] = pd.to_datetime(df['TransactionDate'])

In [67]:
df2 = [df[df['TransactionDate'].dt.month == 6],df[df['TransactionDate'].dt.month == 7]]

In [68]:
df2

[       TransactionID CustomerID CustomerDOB CustGender CustLocation  \
 84               T85   C3839727     20/1/83          M    GHAZIABAD
 85               T86   C2715454      1/5/83          M       NASHIK
 86               T87   C5931634     15/8/95          F      CHENNAI
 87               T88   C7918237      3/9/74          M        JAMMU
 88               T89   C1625292    18/11/88          F   AURANGABAD
 ...              ...        ...         ...        ...          ...
 791469       T791470   C5935088     18/9/87          M      GURGAON
 791470       T791471   C6824061      2/7/92          F       MUMBAI
 791471       T791472   C8423487      4/6/97          F     ITANAGAR
 791472       T791473   C7630463     20/1/97          M       RAIPUR
 791473       T791474   C2349754     27/4/41          M  BOISAR EAST

         CustAccountBalance TransactionDate  TransactionTime  \
 84                21868.16      2016-06-08            90811
 85                13421.46      2016-06-08            32822
 86                 1942.83      2016-06-08           121618
 87                23302.14      2016-06-08           122039
 88                 1880.10      2016-06-08           121749
 ...                    ...             ...              ...
 791469             1032.66      2016-06-09              610
 791470            20158.24      2016-06-09             2723
 791471             1069.64      2016-06-09             3510
 791472            63281.01      2016-06-09            83524
 791473          1026006.91      2016-06-09            91406

         TransactionAmount (INR)
 84                       500.00
 85                        11.00
 86                        28.00
 87                      2200.00
 88                      1499.00
 ...                         ...
 791469                   255.00
 791470                  2012.00
 791471                   199.00
 791472                    25.00
 791473                  1436.58

 [46225 rows x 9 columns],
        TransactionID CustomerID CustomerDOB CustGender CustLocation  \
 193             T194   C4325361    1/1/1800          M      KOLKATA
 194             T195   C5633923     12/4/91          M        NOIDA
 195             T196   C1938713     10/1/67          M      LUCKNOW
 196             T197   C7512180    11/11/78          M     ZIRAKPUR
 197             T198   C3720487     27/9/75          M       JAIPUR
 ...              ...        ...         ...        ...          ...
 904173       T904174   C2842377     31/5/95          M  MUZAFFARPUR
 904174       T904175   C4325271     20/1/93          F    HYDERABAD
 904175       T904176   C8937629     19/1/55          F     ROURKELA
 904176       T904177   C2115711     11/7/83          M    GHAZIABAD
 904177       T904178   C7238035    22/10/91          F    NEW DELHI

         CustAccountBalance TransactionDate  TransactionTime  \
 193              133203.58      2016-07-08            93946
 194                 359.23      2016-07-08            94712
 195              268685.24      2016-07-08           121356
 196             1130141.97      2016-07-08           115829
 197                1223.92      2016-07-08           115644
 ...                    ...             ...              ...
 904173             5910.57      2016-07-09            81738
 904174            53664.23      2016-07-09            82537
 904175            96575.32      2016-07-09            81321
 904176           523803.47      2016-07-09            82727
 904177           129214.76      2016-07-09            71407

         TransactionAmount (INR)
 193                   100000.00
 194                       60.00
 195                     1220.00
 196                      614.00
 197                       69.00
 ...                         ...
 904173                   500.00
 904174                     0.00
 904175                    29.00
 904176                  1000.00
 904177                   459.00

 [48422 rows x 9 columns]]

**8** (Age of customers on transition days) ???????

In [251]:
new_df['Age'] = df['TransactionDate'].dt.year - df['CustomerDOB'].dt.year

In [252]:
new_df

,NumTransaction,AvgAmountTransaction,AvgBalance,AvgDiffBalTrans,Gender,MaxAmountTransaction,MinAmountTransaction,MaxBalance,MinBalance,Age
CustomerID,,,,,,,,,,
C1010011,2,2553.00,76340.63,73787.63,F,4750.00,356.00,120180.54,32500.73,NaN
C1010012,1,1499.00,24204.49,22705.49,M,1499.00,1499.00,24204.49,24204.49,NaN
C1010014,2,727.50,100112.95,99385.45,F,1205.00,250.00,161848.76,38377.14,NaN
C1010018,1,30.00,496.18,466.18,F,30.00,30.00,496.18,496.18,NaN
C1010024,1,5000.00,87058.65,82058.65,M,5000.00,5000.00,87058.65,87058.65,NaN
...,...,...,...,...,...,...,...,...,...,...
C9099836,1,691.00,133067.23,132376.23,M,691.00,691.00,133067.23,133067.23,NaN
C9099877,1,222.00,96063.46,95841.46,M,222.00,222.00,96063.46,96063.46,NaN
C9099919,1,126.00,5559.75,5433.75,M,126.00,126.00,5559.75,5559.75,NaN
C9099941,1,50.00,35295.92,35245.92,M,50.00,50.00,35295.92,35295.92,NaN
C9099956,1,855.00,6968.93,6113.93,M,855.00,855.00,6968.93,6968.93,NaN

In [267]:
(df['TransactionAmount (INR)'] >100).count()

985322

In [272]:
df['TransactionAmount (INR)'] >100

0          False
1           True
2           True
3           True
4           True
           ...
1048562     True
1048563     True
1048564     True
1048565     True
1048566     True
Name: TransactionAmount (INR), Length: 985322, dtype: bool

**13** (Number of transitions made in the night (22-06))

In [326]:
df['TransactionTime'].between_time('0:45', '0:15')

TypeError: Index must be DatetimeIndex

In [352]:
df[df['TransactionTime'].dt.hour  == 22]

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
41,T42,C7923455,1992-10-06,M,ANDHERI (EAST) MUMBAI,5810.82,2016-08-03,1900-01-01 22:11:11,12.00
42,T43,C2733968,1992-12-06,F,AURANGABAD,12545.18,2016-08-03,1900-01-01 22:09:26,179.00
43,T44,C2023055,1993-07-30,M,MUMBAI,10630.88,2016-08-03,1900-01-01 22:20:06,421.80
44,T45,C1289591,1990-10-28,M,KOTA,282455.64,2016-08-03,1900-01-01 22:20:08,900.00
45,T46,C3526781,1980-11-02,M,CHENNAI,1589.43,2016-08-03,1900-01-01 22:26:09,90.00
...,...,...,...,...,...,...,...,...,...
1022948,T1022949,C1149857,1989-08-02,M,NASHIK,8131.98,2016-09-13,1900-01-01 22:00:24,1512.00
1022949,T1022950,C5926378,1990-05-08,M,MUMBAI,10168.93,2016-09-13,1900-01-01 22:02:14,511.00
1022950,T1022951,C6829583,1989-11-27,M,HYDERABAD,138134.84,2016-09-13,1900-01-01 22:02:17,150.00
1023150,T1023151,C4012627,1993-11-12,M,DEHRADUN,59130.70,2016-09-13,1900-01-01 22:09:59,150.00
1048095,T1048096,C4858111,1985-04-25,M,NEW DELHI,344829.08,2016-09-18,1900-01-01 22:23:14,74.95